# Parameter Type Id Energy Analysis Construction Json Property

Source: https://www.revitapidocs.com/2026/c3ec591b-2786-1d27-c8f2-480116eef472.htm

---

| Parameter Type Id Energy Analysis Construction Json Property |
| --- |

"JSON data for Analytical Constructions"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId EnergyAnalysisConstructionJson { get; }
```

```
Public Shared ReadOnly Property EnergyAnalysisConstructionJson As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ EnergyAnalysisConstructionJson {
	ForgeTypeId^ get ();
}
```

```
static member EnergyAnalysisConstructionJson : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace